demo-output/website/dafoam/f6a_epistemic_band/channel1_rans_sweep/kEpsilon/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.;

#include "inletOutletFields/p_outlet"

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            fixedValue;
        value           $p_outlet;
    }
    
    sides
    {
        type            empty;
    }
    
    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
