demo-output/website/dafoam/f6a_epistemic_band/channel1_rans_sweep/kEpsilon/0/inletOutletFields/epsilon_inlet
epsilon_inlet nonuniform List<scalar>
83
(
692642.9257232357
988506.6562199249
667891.6686601264
290605.6580965755
130062.98927871913
69659.28496376975
43581.38236554744
29999.48916999712
...
);
